podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/VREF_MK82F25615.svd.xml
<!--
Devices using this peripheral: 
      MK82F25615
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "VREF_MK82F25615" ?>
         <name>VREF</name>
         <description>Voltage Reference</description>
         <groupName>VREF</groupName>
         <prependToName>VREF</prependToName>
         <headerStructName>VREF</headerStructName>
         <baseAddress>0x40074000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x2</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>TRM</name>
               <description>Trim Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0x40</resetMask>
               <fields>
                  <field>
                     <name>TRIM</name>
                     <description>Trim bits\n
These bits change the resulting VREF by approximately ~0.5 mV for each step</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000000</name>
                           <description>Min</description>
                           <value>0b000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111111</name>
                           <description>Max</description>
                           <value>0b111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHOPEN</name>
                     <description>Chop oscillator enable.\n
When set, internal chopping operation is enabled and the internal analog offset will be minimized</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SC</name>
               <description>Status and Control Register</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>MODE_LV</name>
                     <description>Buffer Mode selection\n
These bits select the buffer modes for the Voltage Reference module</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Bandgap only\tfor stabilization and startup</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>High power buffer mode enabled</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Low-power buffer mode enabled</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VREFST</name>
                     <description>Internal Voltage Reference stable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not ready</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Ready</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ICOMPEN</name>
                     <description>Second order curvature compensation enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ICOMPEN" > <name>REGEN</name> <description>Regulator enable\n
Enabled the internal 1.75 V regulator</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="REGEN" > <name>VREFEN</name> <description>Internal Voltage Reference enable</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
         </registers>
      </peripheral>
